<script setup>
import {nanoid} from 'nanoid'
import Hidden from "@/features/Hidden.vue";

const data = [
  {
    id: nanoid(),
    title: "На что нужно обратить внимание на собеседовании?",
    description: 'Кроме умения представлять себя, грамотно  разговаривать и опрятного внешнего вида, стоит обратить внимание еще на  пару моментов. Они не очевидны, но очень эффективны.',
    tips: [
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      },
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      },
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      }
    ]
  },
  {
    id: nanoid(),
    title: "Возможно ли устроиться без опыта?",
    description: 'Кроме умения представлять себя, грамотно  разговаривать и опрятного внешнего вида, стоит обратить внимание еще на  пару моментов. Они не очевидны, но очень эффективны.',
    tips: [
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      },
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      },
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      }
    ]
  },
  {
    id: nanoid(),
    title: "Как правильно составить резюме?",
    description: 'Кроме умения представлять себя, грамотно  разговаривать и опрятного внешнего вида, стоит обратить внимание еще на  пару моментов. Они не очевидны, но очень эффективны.',
    tips: [
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      },
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      },
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      }
    ]
  },
  {
    id: nanoid(),
    title: "Ошибки на собеседовании. Чего нужно избегать?",
    description: 'Кроме умения представлять себя, грамотно  разговаривать и опрятного внешнего вида, стоит обратить внимание еще на  пару моментов. Они не очевидны, но очень эффективны.',
    tips: [
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      },
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      },
      {
        id: nanoid(),
        title: 'Сохраняйте спокойствие.',
        tip: 'Конечно,  собеседование – это стрессовая ситуация, которая мешает конструктивно  мыслить. Если волнение берет верх – выпейте немного воды, прижмите стопы  к полу, а главное, помните: ничего ужасного произойти не может.'
      }
    ]
  }
]
</script>

<template>
  <article class="afq">
    <div class="afq__container">
      <h3>Ответы на вопросы</h3>
      <div class="afq__questions-list">
        <Hidden
            v-for="item in data"
            :title="item.title"
            :description="item.description"
            :tips="item.tips"
            :key="item.id"
        />
      </div>
    </div>
    <img src="../assets/questions.png" alt="image">
  </article>
</template>


<style>
.afq {

  display: flex;
  justify-content: space-between;
  align-items: flex-start;

  padding: 36px var(--side-padding) 56px;

  background: linear-gradient(163.35deg, rgba(40, 228, 115, 0.16) 11.27%, rgba(70, 205, 22, 0.14) 35.82%, rgba(39, 221, 209, 0.39) 57.4%, rgba(5, 176, 213, 0.32) 82.7%);

  .afq__container {
    padding-top: 24px;

    max-width: 800px;

    h3 {
      font-family: Open Sans, sans-serif;
      font-size: 26px;
      font-weight: 700;

      color: var(--color-blue-m);
    }

    .afq__questions-list {
      margin-top: 46px;

      display: flex;
      flex-direction: column;
      gap: 30px;
    }
  }

  img {
    width: 400px;
  }
  
  @media screen and (max-width: 970px){
    img {
      display: none;
    }
  }
}
</style>